In [1]:
import pandas as pd
import numpy as np

In [2]:
# Empty data frame
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,0],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]], columns =['A','B','C','D','E'])

In [6]:
df1

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [7]:
df1.head(3)

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15

In [8]:
df1.tail(3)

    A   B   C   D   E
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [9]:
df1.shape

(5, 5)

In [10]:
df1.iloc[0:2,0:2]

   A  B
0  1  2
1  6  7

In [11]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  7  8

# Reading csv

In [12]:
df = pd.read_csv('psx.csv')

In [13]:
df.head()

,SYMBOL CODE,BLANK SALE VOLUME,BLANK SALE VALUE (As per Futures Market Closing Price),OPEN INTEREST VOLUME,OPEN INTEREST VALUE (As per Futures Market Closing price),FREE FLOAT,*BLANK SALE AS PERCENTAGE OF OPEN INTEREST,*BLANK SALE AS PERCENTAGE OF FREE FLOAT
0,ASTL-AUG,105000.0,5257350.0,3441500.0,172315905.0,74252857.0,3.0510,0.1414
1,ATRL-AUG,1051325.0,172774750.0,2852500.0,468779850.0,42646500.0,36.8563,2.4652
2,AVN-AUG,420144.0,25196036.0,2670500.0,160149885.0,58213012.0,15.7328,0.7217
3,BAFL-AUG,4000.0,155800.0,1053000.0,41014350.0,710866048.0,0.3799,0.0006
4,BAHL-AUG,500.0,32285.0,2500.0,161425.0,722426520.0,20.0000,0.0001

In [14]:
df['SYMBOL CODE'].astype('category')

0                            ASTL-AUG
1                            ATRL-AUG
2                             AVN-AUG
3                            BAFL-AUG
4                            BAHL-AUG
5                             BOP-AUG
6                            CHCC-AUG
7                            DGKC-AUG
8                             DOL-AUG
9                           EFERT-AUG
10                          ENGRO-AUG
11                           EPCL-AUG
12                           FCCL-AUG
13                           FFBL-AUG
14                            FFL-AUG
15                           GATM-AUG
16                           GHNI-AUG
17                           GHNL-AUG
18                           GTYR-AUG
19                         HASCOL-AUG
20                            HBL-AUG
21                           INIL-AUG
22                            ISL-AUG
23                          KAPCO-AUG
24                            KEL-AUG
25                           KOHC-AUG
26                        LOTCHEM-AUG
27                           LUCK-AUG
28                            MCB-AUG
29                           MEBL-AUG
30                           MLCF-AUG
31                         MUGHAL-AUG
32                            NBP-AUG
33                            NCL-AUG
34                         NETSOL-AUG
35                            NML-AUG
36                            NRL-AUG
37                           OGDC-AUG
38                           PAEL-AUG
39                          PIBTL-AUG
40                           PIOC-AUG
41                            POL-AUG
42                            PPL-AUG
43                            PSO-AUG
44                          SEARL-AUG
45                           SNGP-AUG
46                           SSGC-AUG
47                            TRG-AUG
48                            UBL-AUG
49                          UNITY-AUG
50                                NaN
51                                NaN
52                                NaN
53                                NaN
54    *Rounded to 4th decimal places.
Name: SYMBOL CODE, dtype: category
Categories (51, object): [*Rounded to 4th decimal places., ASTL-AUG, ATRL-AUG, AVN-AUG, ..., SSGC-AUG, TRG-AUG, UBL-AUG, UNITY-AUG]

In [15]:
print(df['SYMBOL CODE'].dtype)

object

In [16]:
print(df['OPEN INTEREST VOLUME'].dtype)

float64

# Writing csv

In [17]:
df1

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [18]:
df1.to_csv('export.csv' , index=False)

In [19]:
df = pd.DataFrame([[1,2,3],[6,7,8],[11,12,13]], columns =['A','B','C'])

In [20]:
df

    A   B   C
0   1   2   3
1   6   7   8
2  11  12  13

In [21]:
df2 = pd.DataFrame([[31,2,33],[46,7,48],[71,2,73]], columns =['X','Y','Z'])

In [22]:
df2

    X  Y   Z
0  31  2  33
1  46  7  48
2  71  2  73

## Merge Dataframes

In [23]:
df3 = pd.merge(df,df2, right_on='Y', left_on='B')

In [25]:
df3

   A  B  C   X  Y   Z
0  1  2  3  31  2  33
1  1  2  3  71  2  73
2  6  7  8  46  7  48

## Series

In [28]:
pd.__version__

'1.0.3'

In [29]:
list1 = np.array([1,2,3,4,'data value'])

In [30]:
list1

array(['1', '2', '3', '4', 'data value'], dtype='<U11')

In [33]:
# Series in pandas perform operation on 1D homogeneous array with indexies
series1 = pd.Series(list1)

In [34]:
series1

0             1
1             2
2             3
3             4
4    data value
dtype: object

In [35]:
type(series1)

pandas.core.series.Series

In [47]:
# empty series
empty1 = pd.Series.empty

In [48]:
empty1

In [53]:
# change index , datatype and give name of the series
series2 = pd.Series([1,2,3,4] , index = ['a','b','c','d'] , dtype = 'int32', name = 'Values')
print(series2)

a    1
b    2
c    3
d    4
Name: Values, dtype: int32

In [57]:
# Scalar  values
scal_s = pd.Series(0.5, index =[1,2,3,4])

In [58]:
scal_s

1    0.5
2    0.5
3    0.5
4    0.5
dtype: float64

In [59]:
# Dictionaries
dict_s = pd.Series({'a':1,'b':2})
print(dict_s)

a    1
b    2
dtype: int64

In [60]:
series2

a    1
b    2
c    3
d    4
Name: Values, dtype: int32

In [61]:
s4 = series2

In [62]:
s4

a    1
b    2
c    3
d    4
Name: Values, dtype: int32

In [63]:
s4[0]

1

In [64]:
#Slicing
s4[0:2]

a    1
b    2
Name: Values, dtype: int32

In [67]:
np.max(s4)

4

In [68]:
# condion operator
s4[s4>2]

c    3
d    4
Name: Values, dtype: int32

In [73]:
s5 = pd.Series(np.array([0,1,2,5]), index = ['a','b','c','d'], dtype = 'int32')

In [74]:
s4 + s5

a    1
b    3
c    5
d    9
dtype: int32

In [75]:
s1 = pd.Series(np.array([1,2]), index =['a','b'], dtype ='int32')

In [77]:
# NaN stands for not a number
s1+s5

a    1.0
b    3.0
c    NaN
d    NaN
dtype: float64

## Dataframe